// BSLLS:ExportVariables-off
// BSLLS:MissingVariablesDescription-off

&Сериализуемое("number")
Перем Число Экспорт; 

&Сериализуемое
Перем Строка Экспорт;

&Сериализуемое
Перем Булево Экспорт;

&Сериализуемое
Перем Дата Экспорт;

&Сериализуемое
Перем ПолеНеопределено Экспорт;

&Сериализуемое(Обязательное = Истина)
Перем ОбязательноеНеопределено Экспорт;

&Сериализуемое(Обязательное = Ложь)
Перем НеобязательноеНеопределено Экспорт;

&Сериализуемое
Перем ПолеNull Экспорт;

&Сериализуемое
Перем Массив Экспорт;

&Сериализуемое
&Тип("Структура")
Перем Структура Экспорт;

&Сериализуемое
Перем МассивСтруктур Экспорт;

&Сериализуемое
Перем Соответствие Экспорт;

&Сериализуемое
&Тип("ТестовыйКласс")
Перем Ссылка Экспорт;

&Тип("Структура")
&ДляКаждого
&Тип("ТестовыйКласс")
Перем СтруктураПользовательскихОбъектов Экспорт;

&Тип("Массив")
&ДляКаждого
&Тип("ТестовыйКласс")
Перем МассивПользовательскихОбъектов Экспорт;

Процедура ПриСозданииОбъекта(пЧисло = Неопределено)

	Если пЧисло <> Неопределено Тогда
		Число = пЧисло;
	КонецЕсли;

КонецПроцедуры
