// BSLLS:ExportVariables-off
// BSLLS:MissingVariablesDescription-off

&JsonСвойство("number")
Перем Число Экспорт; 

&JsonСвойство
Перем Строка Экспорт;

&JsonСвойство
Перем Булево Экспорт;

&JsonСвойство
Перем Дата Экспорт;

&JsonСвойство
Перем ПолеНеопределено Экспорт;

&JsonСвойство(Обязательное = Истина)
Перем ОбязательноеНеопределено Экспорт;

&JsonСвойство(Обязательное = Ложь)
Перем НеобязательноеНеопределено Экспорт;

&JsonСвойство
Перем ПолеNull Экспорт;

&JsonСвойство
Перем Массив Экспорт;

&JsonСвойство
Перем Структура Экспорт;

&JsonСвойство
Перем МассивСтруктур Экспорт;

&JsonСвойство
Перем Соответствие Экспорт;

&JsonСвойство
Перем Ссылка Экспорт;

&Сериализуемое
Процедура ПриСозданииОбъекта()
КонецПроцедуры
