// BSLLS:ExportVariables-off
// BSLLS:MissingVariablesDescription-off

&Сериализуемое("number")
Перем Число Экспорт; 

&Сериализуемое
Перем Строка Экспорт;

&Сериализуемое
Перем Булево Экспорт;

&Сериализуемое
Перем Дата Экспорт;

&Сериализуемое
Перем ПолеНеопределено Экспорт;

&Сериализуемое(Обязательное = Истина)
Перем ОбязательноеНеопределено Экспорт;

&Сериализуемое(Обязательное = Ложь)
Перем НеобязательноеНеопределено Экспорт;

&Сериализуемое
Перем ПолеNull Экспорт;

&Сериализуемое
Перем Массив Экспорт;

&Сериализуемое
&Тип("Структура")
Перем Структура Экспорт;

&Сериализуемое
Перем МассивСтруктур Экспорт;

&Сериализуемое
Перем Соответствие Экспорт;

&Сериализуемое
&Тип("ТестовыйКласс")
Перем Ссылка Экспорт;

Процедура ПриСозданииОбъекта()
КонецПроцедуры
