// BSLLS:ExportVariables-off
// BSLLS:MissingVariablesDescription-off

// Тестовый класс для проверки сериализации полей без ключевого слова Экспорт

&JsonСвойство("number")
Перем Число; 

&JsonСвойство
Перем Строка;

&JsonСвойство
Перем Булево;

&JsonСвойство
Перем Дата;

&JsonСвойство
Перем ПолеНеопределено;

&JsonСвойство(Обязательное = Истина)
Перем ОбязательноеНеопределено;

&JsonСвойство(Обязательное = Ложь)
Перем НеобязательноеНеопределено;

&JsonСвойство
Перем ПолеNull;

&JsonСвойство
Перем Массив;

&JsonСвойство
Перем Структура;

&Сериализуемое
Процедура ПриСозданииОбъекта()
КонецПроцедуры