// BSLLS:DuplicateStringLiteral-off
// BSLLS:MagicNumber-off
#Использовать ".."
#Использовать "."
#Использовать asserts

&Тест
Процедура ДесериализоватьПростойОбъект() Экспорт
	// Дано
	ТестовыйКласс = Новый ТестовыйКласс();

	ТестовыйКласс.Число = 1;

	СериализаторJson = Новый СериализаторJson();
	Строка = СериализаторJson.Сериализовать(ТестовыйКласс);

	ДесериализаторJson = Новый ДесериализаторJson();
	Объект = ДесериализаторJson.Десериализовать(Строка, Тип("ТестовыйКласс"));

	// Проверка
	Ожидаем.Что(Объект).ИмеетТип("ТестовыйКласс");
	Ожидаем.Что(Объект.Число).Равно(1);

КонецПроцедуры
